InformationRegisters/СвязкиОрганизацийПроизводстваКонтрагентРозницыУдаленноеПодключение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязкиОрганизацийПроизводстваКонтрагентРозницыУдаленноеПодключение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОрганизацияПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьАдресМонтажаВШапкеДокумента</Name>
					<Comment>#7805</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОрганизацияКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязкиОрганизацийПроизводстваКонтрагентРозницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязкиОрганизацийПроизводстваКонтрагентРозницы</Name>
			<Comment>#7381</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОрганизацияПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтрагентПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтображатьАдресМонтажаВШапкеДокумента</Name>
					<Comment>#7805</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязкиОрганизацийПроизводстваКонтрагентРозницыУдаленноеПодключение/Ext/ManagerModule.bsl
Функция ОтгрузкаПоСвязкеОрганизацииПроизводстваКонтрагентаРозницы(Организация, Контрагент, ОрганизацияПоступления = Неопределено, КонтрагентПоступления = Неопределено, СкладПоступления = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Связки.Организация КАК Организация,
	|	Связки.Контрагент КАК Контрагент,
	//++ 8373
	|	Связки.ОрганизацияПоступления КАК ОрганизацияПоступления,
	|	Связки.КонтрагентПоступления КАК КонтрагентПоступления,
	//-- 8373
	//++ #7764
	|	Связки.СкладПоступления КАК СкладПоступления
	//-- #7764
	|ИЗ
	|	РегистрСведений.СвязкиОрганизацийПроизводстваКонтрагентРозницы КАК Связки
	|ГДЕ
	|	Связки.Организация = &Организация
	|	И Связки.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//++ №8373 проставим организацию и контрагента поступления
	//Возврат НЕ РезультатЗапроса.Пустой();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//++ №7764 комментируем, т.к. реквизиты в РТиУ удалены
		//ОрганизацияПоступления = Выборка.ОрганизацияПоступления;
		//КонтрагентПоступления  = Выборка.КонтрагентПоступления;
		//СкладПоступления  	   = Выборка.СкладПоступления;
		//-- №7764
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	//-- №8373
	
КонецФункции
